/* ==============================================================================
 * 创 建 者：Fowindy
 * 创建日期：2020年2月16日 星期日 22:40:21
 * ==============================================================================*/
using System;
using System.Collections.Generic;
using System.Text;
using System.Xml;

namespace Day01_04.登记案例
{
    ///<![CDATA[01.01.[接口知识点]:
    ///         1.接口的命名规范:默认以I开头(也可以不用);
    ///         2.接口的访问修饰符:internal(默认:当前程序集访问),也可以加public;
    ///         3.接口中的成员不需要访问修饰符,默认就是public,因为接口的目的就是为了继承多态;
    ///         4.接口的成员不能有实现,接口是为了多态,实现虚方法或抽象方法;
    ///         ]]>
    public interface IDengJi
    {
        void DengJi();
    }
}
